Autodesk.Revit.DB.ExternalData.CoordinationModelElementProperty.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalData.CoordinationModelElementProperty.Value
The value of the property provided as a string.
Remarks:
For values that imply an unit of measurement, the string contains the formatted data according to the units defined in the source of the Coordination Model.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelElementProperty.Group
The name of the group of properties to which this property belongs to. E.g. Group = Identity Data.
Remarks:
This string is taken from the source of the Coordination Model and it's not localized in Revit.
For example: If the source of the Coordination Model is in Chinese, the property group will always be in Chinese in Revit, regardless of the Revit language settings.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelElementProperty.Name
The name of the property.
Remarks:
This string is taken from the source of the Coordination Model and it's not localized in Revit.
For example: If the source of the Coordination Model is in Chinese, the property will always be in Chinese in Revit, regardless of the Revit language settings.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelElementProperty
A class that defines a property of an element inside a Coordination Model.
Since:
2026.3